# IDropHandler Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IDropHandler Interface
Members See Also
---
An interface to be executed when custom data is dragged and dropped onto the Revit user interface.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public interface IDropHandler
```

Visual Basic
---
```text
Public Interface IDropHandler
```

Visual C++
---
```text
public interface class IDropHandler
```

# Remarks
Custom data is supported for drag and drop only during an invocation of the DoDragDrop method on Application.
# See Also
IDropHandler Members
Autodesk.Revit.UI Namespace